# GetDLComponentName

## Description
Gets the name of the component at index in the Double Line Preferences.

```pascal
FUNCTION GetDLComponentName(index : INTEGER) : STRING;
```

```python

def vs.GetDLComponentName(index):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the component.|

## Returns
The name of the component.

## See Also
VS Functions:
SetDLComponentName

## Version
Availability: from VectorWorks 2008
## Category
* Document Settings